<img src="https://github.com/danielscarvalho/data/blob/master/img/FIAP-logo.png?raw=True" style="float:right;" width="200px">

# DATA SCIENCE & STATISTICAL COMPUTING [》](https://www.fiap.com.br/)

## Dataframe & Python

### LAP Parte 2: “Cookbook"

https://pandas.pydata.org/docs/user_guide/cookbook.html#cookbook

Sugestão: Colocar a página do Cookbook lado a lado com este notebook para realizar as operações.

In [1]:
import pandas as pd
import numpy as np

In [2]:
 df = pd.DataFrame(
     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
 )

 df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [3]:
 df.loc[df.AAA >= 5, "BBB"] = -1

 df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [4]:
 df.loc[df.AAA >= 5, ["BBB", "CCC"]] = 555

 df

   AAA  BBB  CCC
0    4   10  100
1    5  555  555
2    6  555  555
3    7  555  555

In [5]:
 df.loc[df.AAA < 5, ["BBB", "CCC"]] = 2000

 df

   AAA   BBB   CCC
0    4  2000  2000
1    5   555   555
2    6   555   555
3    7   555   555

In [6]:
 df_mask = pd.DataFrame(
   {"AAA": [True] * 4, "BBB": [False] * 4, "CCC": [True, False] * 2}
 )


 df.where(df_mask, -1000)

   AAA   BBB   CCC
0    4 -1000  2000
1    5 -1000 -1000
2    6 -1000   555
3    7 -1000 -1000

In [7]:
 df = pd.DataFrame(
     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
 )
 

 df


 df["logic"] = np.where(df["AAA"] > 5, "high", "low")

 df

   AAA  BBB  CCC logic
0    4   10  100   low
1    5   20   50   low
2    6   30  -30  high
3    7   40  -50  high

In [8]:
 df = pd.DataFrame(
     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
 )


 df


 df[df.AAA <= 5]


 df[df.AAA > 5]

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

In [9]:
 df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
 )
 

 df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [10]:
 df.loc[(df["BBB"] < 25) & (df["CCC"] >= -40), "AAA"]

0    4
1    5
Name: AAA, dtype: int64

In [11]:
 df.loc[(df["BBB"] > 25) | (df["CCC"] >= -40), "AAA"]

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64

In [12]:
 df.loc[(df["BBB"] > 25) | (df["CCC"] >= 75), "AAA"] = 999

 df

   AAA  BBB  CCC
0  999   10  100
1    5   20   50
2  999   30  -30
3  999   40  -50

In [13]:
 df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
 )


 df


 aValue = 43.0

 df.loc[(df.CCC - aValue).abs().argsort()]

   AAA  BBB  CCC
1    5   20   50
0    4   10  100
2    6   30  -30
3    7   40  -50

In [14]:
 df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
 )
 

 df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [15]:
 Crit1 = df.AAA <= 5.5

 Crit2 = df.BBB == 10.0

 Crit3 = df.CCC > -40.0

In [16]:
 AllCrit = Crit1 & Crit2 & Crit3

In [17]:
 import functools

 CritList = [Crit1, Crit2, Crit3]

 AllCrit = functools.reduce(lambda x, y: x & y, CritList)

 df[AllCrit]

   AAA  BBB  CCC
0    4   10  100

In [18]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [19]:
df[(df.AAA <= 6) & (df.index.isin([0, 2, 4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [20]:
f = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]},
    index=["foo", "bar", "boo", "kar"],
)

In [21]:
df.loc["bar":"kar"]  # Label

Empty DataFrame
Columns: [AAA, BBB, CCC]
Index: []

In [22]:
df[0:3]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30

In [24]:
data = {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

In [25]:
df2 = pd.DataFrame(data=data, index=[1, 2, 3, 4])  # Note index starts at 1.

In [26]:
df2.iloc[1:3]  # Position-oriented

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [27]:
df2.loc[1:3]  # Label-oriented

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [28]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)

In [29]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [30]:
df[~((df.AAA <= 6) & (df.index.isin([0, 2, 4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

In [31]:
df = pd.DataFrame({"AAA": [1, 2, 1, 3], "BBB": [1, 1, 2, 2], "CCC": [2, 1, 3, 1]})

df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [32]:
source_cols = df.columns  # Or some subset would work too

In [33]:
new_cols = [str(x) + "_cat" for x in source_cols]

In [34]:
categories = {1: "Alpha", 2: "Beta", 3: "Charlie"}

In [38]:
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [39]:
df = pd.DataFrame(
    {"AAA": [1, 1, 1, 2, 2, 2, 3, 3], "BBB": [2, 1, 3, 4, 5, 1, 2, 3]}
)

In [40]:
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [41]:
df.loc[df.groupby("AAA")["BBB"].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

In [42]:
df.sort_values(by="BBB").groupby("AAA", as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2

In [43]:
df = pd.DataFrame(
    {
        "row": [0, 1, 2],
        "One_X": [1.1, 1.1, 1.1],
        "One_Y": [1.2, 1.2, 1.2],
        "Two_X": [1.11, 1.11, 1.11],
        "Two_Y": [1.22, 1.22, 1.22],
    }
)

In [44]:
df

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [45]:
df = df.set_index("row")

In [46]:
df

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.22
1      1.1    1.2   1.11   1.22
2      1.1    1.2   1.11   1.22

In [47]:
df.columns = pd.MultiIndex.from_tuples([tuple(c.split("_")) for c in df.columns])

In [48]:
df

     One        Two
       X    Y     X     Y
row
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

In [51]:
cols = pd.MultiIndex.from_tuples(
    [(x, y) for x in ["A", "B", "C"] for y in ["O", "I"]]
)

In [52]:
df = pd.DataFrame(np.random.randn(2, 6), index=["n", "m"], columns=cols)

In [53]:
df

          A                   B                   C
          O         I         O         I         O         I
n  1.230345 -0.604644 -0.537250 -0.991240 -0.970963  2.036088
m -2.685140  0.975071 -0.168943 -1.028383 -0.873811 -0.596048

In [54]:
df = df.div(df["C"], level=1)

df

          A                   B              C
          O         I         O         I    O    I
n -1.267139 -0.296964  0.553316 -0.486836  1.0  1.0
m  3.072907 -1.635893  0.193340  1.725335  1.0  1.0

In [55]:
coords = [("AA", "one"), ("AA", "six"), ("BB", "one"), ("BB", "two"), ("BB", "six")]

In [56]:
index = pd.MultiIndex.from_tuples(coords)

In [57]:
df = pd.DataFrame([11, 22, 33, 44, 55], index, ["MyData"])

df

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [58]:
df.xs("BB", level=0, axis=0)

     MyData
one      33
two      44
six      55

In [59]:
df.xs("six", level=1, axis=0)

    MyData
AA      22
BB      55

In [60]:
import itertools

In [61]:
index = list(itertools.product(["Ada", "Quinn", "Violet"], ["Comp", "Math", "Sci"]))

headr = list(itertools.product(["Exams", "Labs"], ["I", "II"]))

indx = pd.MultiIndex.from_tuples(index, names=["Student", "Course"])

cols = pd.MultiIndex.from_tuples(headr)  # Notice these are un-named

data = [[70 + x + y + (x * y) % 3 for x in range(4)] for y in range(9)]

df = pd.DataFrame(data, indx, cols)

df

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [62]:
All = slice(None)

In [63]:
df.loc["Violet"]

       Exams     Labs
           I  II    I  II
Course
Comp      76  77   78  79
Math      77  79   81  80
Sci       78  81   81  81

In [64]:
df.loc[(All, "Math"), All]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77
Violet  Math      77  79   81  80

In [65]:
df.loc[(slice("Ada", "Quinn"), "Math"), All]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77

In [66]:
df.loc[(All, "Math"), ("Exams")]

                 I  II
Student Course
Ada     Math    71  73
Quinn   Math    74  76
Violet  Math    77  79

In [67]:
df.loc[(All, "Math"), (All, "II")]

               Exams Labs
                  II   II
Student Course
Ada     Math      73   74
Quinn   Math      76   77
Violet  Math      79   80

In [68]:
df.sort_values(by=("Labs", "II"), ascending=False)

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

In [69]:
df = pd.DataFrame(
    np.random.randn(6, 1),
    index=pd.date_range("2013-08-01", periods=6, freq="B"),
    columns=list("A"),
)

In [70]:
df.loc[df.index[3], "A"] = np.nan

In [71]:
df

                   A
2013-08-01  0.530973
2013-08-02  1.090145
2013-08-05  0.634828
2013-08-06       NaN
2013-08-07 -0.669951
2013-08-08 -0.406344

In [72]:
df.bfill()

                   A
2013-08-01  0.530973
2013-08-02  1.090145
2013-08-05  0.634828
2013-08-06 -0.669951
2013-08-07 -0.669951
2013-08-08 -0.406344

In [73]:
df = pd.DataFrame(
    {
        "animal": "cat dog cat fish dog cat cat".split(),
        "size": list("SSMMMLL"),
        "weight": [8, 10, 11, 1, 20, 12, 12],
        "adult": [False] * 5 + [True] * 2,
    }
)

df

  animal size  weight  adult
0    cat    S       8  False
1    dog    S      10  False
2    cat    M      11  False
3   fish    M       1  False
4    dog    M      20  False
5    cat    L      12   True
6    cat    L      12   True

In [75]:
gb = df.groupby("animal")

In [76]:
gb.get_group("cat")

  animal size  weight  adult
0    cat    S       8  False
2    cat    M      11  False
5    cat    L      12   True
6    cat    L      12   True

In [77]:
def GrowUp(x):
    avg_weight = sum(x[x["size"] == "S"].weight * 1.5)
    avg_weight += sum(x[x["size"] == "M"].weight * 1.25)
    avg_weight += sum(x[x["size"] == "L"].weight)
    avg_weight /= len(x)
    return pd.Series(["L", avg_weight, True], index=["size", "weight", "adult"])

In [81]:
S = pd.Series([i / 100.0 for i in range(1, 11)])

In [82]:
def cum_ret(x, y):
    return x * (1 + y)

In [83]:
def red(x):
    return functools.reduce(cum_ret, x, 1.0)

In [84]:
S.expanding().apply(red, raw=True)

0    1.010000
1    1.030200
2    1.061106
3    1.103550
4    1.158728
5    1.228251
6    1.314229
7    1.419367
8    1.547110
9    1.701821
dtype: float64

In [85]:
df = pd.DataFrame({"A": [1, 1, 2, 2], "B": [1, -1, 1, 2]})

In [86]:
gb = df.groupby("A")

In [87]:
def replace(g):
    mask = g < 0
    return g.where(~mask, g[~mask].mean())

In [88]:
gb.transform(replace)

   B
0  1
1  1
2  1
3  2

In [89]:
df = pd.DataFrame(
    {
        "code": ["foo", "bar", "baz"] * 2,
        "data": [0.16, -0.21, 0.33, 0.45, -0.59, 0.62],
        "flag": [False, True] * 3,
    }
)

In [90]:
code_groups = df.groupby("code")

In [91]:
agg_n_sort_order = code_groups[["data"]].transform("sum").sort_values(by="data")

In [92]:
sorted_df = df.loc[agg_n_sort_order.index]

In [93]:
sorted_df

  code  data   flag
1  bar -0.21   True
4  bar -0.59  False
0  foo  0.16  False
3  foo  0.45   True
2  baz  0.33  False
5  baz  0.62   True

In [94]:
rng = pd.date_range(start="2014-10-07", periods=10, freq="2min")

In [95]:
ts = pd.Series(data=list(range(10)), index=rng)

In [96]:
def MyCust(x):
    if len(x) > 2:
        return x.iloc[1] * 1.234
    return pd.NaT

In [97]:
mhc = {"Mean": "mean", "Max": "max", "Custom": MyCust}

In [99]:
df = pd.DataFrame(
    {"Color": "Red Red Red Blue".split(), "Value": [100, 150, 50, 50]}
)

In [100]:
df

  Color  Value
0   Red    100
1   Red    150
2   Red     50
3  Blue     50

In [101]:
df["Counts"] = df.groupby(["Color"]).transform(len)

df

  Color  Value  Counts
0   Red    100       3
1   Red    150       3
2   Red     50       3
3  Blue     50       1

In [103]:
df = pd.DataFrame(
    {"line_race": [10, 10, 8, 10, 10, 8], "beyer": [99, 102, 103, 103, 88, 100]},
    index=[
        "Last Gunfighter",
        "Last Gunfighter",
        "Last Gunfighter",
        "Paynter",
        "Paynter",
        "Paynter",
    ],
)

df

                 line_race  beyer
Last Gunfighter         10     99
Last Gunfighter         10    102
Last Gunfighter          8    103
Paynter                 10    103
Paynter                 10     88
Paynter                  8    100

In [104]:
df["beyer_shifted"] = df.groupby(level=0)["beyer"].shift(1)

In [105]:
df

                 line_race  beyer  beyer_shifted
Last Gunfighter         10     99            NaN
Last Gunfighter         10    102           99.0
Last Gunfighter          8    103          102.0
Paynter                 10    103            NaN
Paynter                 10     88          103.0
Paynter                  8    100           88.0

In [106]:
df = pd.DataFrame(
    {
        "host": ["other", "other", "that", "this", "this"],
        "service": ["mail", "web", "mail", "mail", "web"],
        "no": [1, 2, 1, 2, 1],
    }
).set_index(["host", "service"])

In [107]:
mask = df.groupby(level=0).agg("idxmax")

In [108]:
df_count = df.loc[mask["no"]].reset_index()

In [109]:
df_count

    host service  no
0  other     web   2
1   that    mail   1
2   this    mail   2

In [110]:
df = pd.DataFrame([0, 1, 0, 1, 1, 1, 0, 1, 1], columns=["A"])

In [111]:
df["A"].groupby((df["A"] != df["A"].shift()).cumsum()).groups

{1: [0], 2: [1], 3: [2], 4: [3, 4, 5], 5: [6], 6: [7, 8]}

In [112]:
df["A"].groupby((df["A"] != df["A"].shift()).cumsum()).cumsum()

0    0
1    1
2    0
3    1
4    2
5    3
6    0
7    1
8    2
Name: A, dtype: int64

In [113]:
df = pd.DataFrame(
    data={
        "Case": ["A", "A", "A", "B", "A", "A", "B", "A", "A"],
        "Data": np.random.randn(9),
    }
)

In [114]:
dfs = list(
    zip(
        *df.groupby(
            (1 * (df["Case"] == "B"))
            .cumsum()
            .rolling(window=3, min_periods=1)
            .median()
        )
    )
)[-1]

In [115]:
dfs[0]

  Case      Data
0    A -0.939662
1    A  0.625370
2    A -0.881457
3    B  0.229937

In [116]:
dfs[1]

  Case      Data
4    A -0.428404
5    A -1.214777
6    B -0.479687

In [118]:
dfs[2]

  Case      Data
7    A  0.557017
8    A  0.568282

In [119]:
df = pd.DataFrame(
    data={
        "Province": ["ON", "QC", "BC", "AL", "AL", "MN", "ON"],
        "City": [
            "Toronto",
            "Montreal",
            "Vancouver",
            "Calgary",
            "Edmonton",
            "Winnipeg",
            "Windsor",
        ],
        "Sales": [13, 6, 16, 8, 4, 3, 1],
    }
)

In [120]:
table = pd.pivot_table(
    df,
    values=["Sales"],
    index=["Province"],
    columns=["City"],
    aggfunc="sum",
    margins=True,
)

In [122]:
grades = [48, 99, 75, 80, 42, 80, 72, 68, 36, 78]

In [123]:
df = pd.DataFrame(
    {
        "ID": ["x%d" % r for r in range(10)],
        "Gender": ["F", "M", "F", "M", "F", "M", "F", "M", "M", "M"],
        "ExamYear": [
            "2007",
            "2007",
            "2007",
            "2008",
            "2008",
            "2008",
            "2008",
            "2009",
            "2009",
            "2009",
        ],
        "Class": [
            "algebra",
            "stats",
            "bio",
            "algebra",
            "algebra",
            "stats",
            "stats",
            "algebra",
            "bio",
            "bio",
        ],
        "Participated": [
            "yes",
            "yes",
            "yes",
            "yes",
            "no",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
        ],
        "Passed": ["yes" if x > 50 else "no" for x in grades],
        "Employed": [
            True,
            True,
            True,
            False,
            False,
            False,
            False,
            True,
            True,
            False,
        ],
        "Grade": grades,
    }
)

In [124]:
df.groupby("ExamYear").agg(
    {
        "Participated": lambda x: x.value_counts()["yes"],
        "Passed": lambda x: sum(x == "yes"),
        "Employed": lambda x: sum(x),
        "Grade": lambda x: sum(x) / len(x),
    }
)

          Participated  Passed  Employed      Grade
ExamYear
2007                 3       2         3  74.000000
2008                 3       3         0  68.500000
2009                 3       2         2  60.666667

In [126]:
df = pd.DataFrame(
    data={
        "A": [[2, 4, 8, 16], [100, 200], [10, 20, 30]],
        "B": [["a", "b", "c"], ["jj", "kk"], ["ccc"]],
    },
    index=["I", "II", "III"],
)

In [127]:
def SeriesFromSubList(aList):
    return pd.Series(aList)

In [128]:
df_orgz = pd.concat(
    {ind: row.apply(SeriesFromSubList) for ind, row in df.iterrows()}
)

In [129]:
df_orgz

         0     1     2     3
I   A    2     4     8  16.0
    B    a     b     c   NaN
II  A  100   200   NaN   NaN
    B   jj    kk   NaN   NaN
III A   10  20.0  30.0   NaN
    B  ccc   NaN   NaN   NaN

In [131]:
df = pd.DataFrame(
    data=np.random.randn(2000, 2) / 10000,
    index=pd.date_range("2001-01-01", periods=2000),
    columns=["A", "B"],
)

df

                   A         B
2001-01-01 -0.000138 -0.000124
2001-01-02  0.000045 -0.000074
2001-01-03  0.000180 -0.000058
2001-01-04 -0.000164  0.000106
2001-01-05  0.000042  0.000179
...              ...       ...
2006-06-19 -0.000073 -0.000158
2006-06-20 -0.000138 -0.000001
2006-06-21  0.000040 -0.000033
2006-06-22 -0.000037  0.000175
2006-06-23 -0.000003 -0.000193

[2000 rows x 2 columns]

In [132]:
def gm(df, const):
    v = ((((df["A"] + df["B"]) + 1).cumprod()) - 1) * const
    return v.iloc[-1]

In [133]:
s = pd.Series(
    {
        df.index[i]: gm(df.iloc[i: min(i + 51, len(df) - 1)], 5)
        for i in range(len(df) - 50)
    }
)

s

2001-01-01    0.000728
2001-01-02    0.002005
2001-01-03    0.002786
2001-01-04    0.002105
2001-01-05    0.001616
                ...
2006-04-30   -0.001873
2006-05-01   -0.001215
2006-05-02    0.000750
2006-05-03    0.000579
2006-05-04   -0.000801
Length: 1950, dtype: float64

In [134]:
rng = pd.date_range(start="2014-01-01", periods=100)

In [136]:
df = pd.DataFrame(
    {
        "Open": np.random.randn(len(rng)),
        "Close": np.random.randn(len(rng)),
        "Volume": np.random.randint(100, 2000, len(rng)),
    },
    index=rng,
)

df

                Open     Close  Volume
2014-01-01  1.161440 -0.427363    1348
2014-01-02 -0.179329 -1.027857    1743
2014-01-03  0.065982 -0.194291     313
2014-01-04 -1.011098  1.056423    1042
2014-01-05 -1.406709  0.941165    1672
...              ...       ...     ...
2014-04-06  0.863067 -0.895135    1532
2014-04-07  0.179371 -0.382145    1917
2014-04-08 -0.996218  1.710906     606
2014-04-09 -0.381616 -2.201800     268
2014-04-10 -0.185399  0.905295     457

[100 rows x 3 columns]

In [137]:
def vwap(bars):
    return (bars.Close * bars.Volume).sum() / bars.Volume.sum()

In [138]:
window = 5

In [139]:
s = pd.concat(
    [
        (pd.Series(vwap(df.iloc[i: i + window]), index=[df.index[i + window]]))
        for i in range(len(df) - window)
    ]
)

In [140]:
s.round(2)

2014-01-06    0.04
2014-01-07   -0.29
2014-01-08    0.28
2014-01-09    0.16
2014-01-10   -0.07
              ...
2014-04-06    0.38
2014-04-07    0.03
2014-04-08   -0.23
2014-04-09   -0.41
2014-04-10   -0.29
Length: 95, dtype: float64

In [141]:
dates = pd.date_range("2000-01-01", periods=5)

In [142]:
dates.to_period(freq="M").to_timestamp()

DatetimeIndex(['2000-01-01', '2000-01-01', '2000-01-01', '2000-01-01',
               '2000-01-01'],
              dtype='datetime64[ns]', freq=None)

In [143]:
rng = pd.date_range("2000-01-01", periods=6)

In [144]:
df1 = pd.DataFrame(np.random.randn(6, 3), index=rng, columns=["A", "B", "C"])

In [145]:
df2 = df1.copy()

In [146]:
df = pd.concat([df1, df2], ignore_index=True)

In [147]:
df

           A         B         C
0   0.162673 -0.728262  0.954400
1   0.371516  0.113258  0.025509
2  -1.364404  0.170587  1.761573
3  -0.630145 -0.554265  1.858189
4   0.961024  0.856802 -0.408236
5  -0.347941 -1.031325  1.908381
6   0.162673 -0.728262  0.954400
7   0.371516  0.113258  0.025509
8  -1.364404  0.170587  1.761573
9  -0.630145 -0.554265  1.858189
10  0.961024  0.856802 -0.408236
11 -0.347941 -1.031325  1.908381

In [149]:
df = pd.DataFrame(
    data={
        "Area": ["A"] * 5 + ["C"] * 2,
        "Bins": [110] * 2 + [160] * 3 + [40] * 2,
        "Test_0": [0, 1, 0, 1, 2, 0, 1],
        "Data": np.random.randn(7),
    }
)

df

  Area  Bins  Test_0      Data
0    A   110       0 -1.592555
1    A   110       1 -0.745977
2    A   160       0 -0.935278
3    A   160       1 -0.999583
4    A   160       2 -0.939010
5    C    40       0 -0.203789
6    C    40       1 -0.410432

In [150]:
df["Test_1"] = df["Test_0"] - 1